Revit 2027 API
PrintManager.SelectNewPrintDriver Method
 Select a new printer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SelectNewPrintDriver(
	string strPrinterName
)
Public Sub SelectNewPrintDriver (
	strPrinterName As String
)
public:
void SelectNewPrintDriver(
	String^ strPrinterName
)
member SelectNewPrintDriver :
        strPrinterName : string -> unit
Parameters
strPrinterName String
The name string of new printer.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-strPrinterName-is null.
InvalidOperationException |  Thrown when the assigned new printer is invalid, or the print resource is occupied by others.
Remarks
 This property is the global print setting property for all documents.
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace